{
  "HOME": {
    "TITLE": "Energy Web DApp showcase",
    "SECTION_1_TITLE": "Cos'è Energy Web?",
    "SECTION_1_TEXT": "Energy Web è un progetto che utilizza le tecnologie distribuite, come la blockchain, al fine di promuovere un mercato dell'energia con un basso utilizzo di combustibili fossili e con un focus sui piccoli produttori.\nNel 2019 è stata rilasciata la Energy Web Chain (EWC), la blockchain sulla quale si basano i servizi di Energy Web.",
    "SECTION_2_TITLE": "Energy Web Dos",
    "SECTION_2_TEXT": "Il cuore del progetto di Energy Web è EW-DOS, un’infrastruttura open-source, pubblica e digitale.\nL’intero sistema è costituito da tre macro componenti, ognuno con uno scopo specifico:",
    "SECTION_2_ITEM_1": "Trust: Energy Web Chain (EWC)",
    "SECTION_2_ITEM_2": "Utility: Servizi e astrazioni sopra la blockchain",
    "SECTION_2_ITEM_3": "Toolkit: Frameworks e strumenti per la costruzione di applicazioni",
    "SECTION_2_IMG": "Schema di EW-Dos",
    "SECTION_3_TITLE": "Livello Trust",
    "SECTION_3_TEXT": "Il ruolo principale della EWC è quello di assicurare che ci sia consenso sui dati e che tutte le applicazioni e gli smart contracts si comportino in maniera deterministica.\nSi basa sulla Ethereum Virtual Machine (EVM), quindi consente la creazione di smart contract e rispetta tutti gli Ethereum Request for Comment (ERC).\nÈ presente anche una test-net, chiamata Volta, usata per testare i progetti è le applicazioni prima di lanciare sulla main-net.\nL’algoritmo di consenso è Proof of Authority (POA), basato sul protocollo AuRA. A costo di una minore decentralizzazione, assicura performance molto elevata.\nIl token usato sulla blockchain si chiama Energy Web Token (EWT).",
    "SECTION_4_TITLE": "Livello Utility",
    "SECTION_4_TEXT": "L’utility layer è composto da un insieme di servizi basati sulla EWC che hanno lo scopo di rendere quanto più accessibile e invitante possibile l’intera infrastruttura per gli sviluppatori.\nTutti i servizi vengono pagati in EWT. \nVengono individuate 3 ampie categorie di servizi: Esperienza dell’utente finale, Interoperabilità Multipiattaforma, Performance delle applicazioni.\n\nAlcuni esempi sono:",
    "SECTION_5_TITLE": "Livello Toolkits",
    "SECTION_5_TEXT": "Insieme di framework e servizi pensati per realizzare applicazioni decentralizzate su EW-DOS.\n\nGli esempi principali sono due:",
    "SECTION_4_ITEM_1": "EWNS: Seguendo lo stesso principio di un DNS, associa domini ad indirizzi sulla blockchain",
    "SECTION_4_ITEM_2": "Oracles: Nodi che è possibile consultare con il protocollo Chainlink per ricevere dati di eventi esterni alla blockchain",
    "SECTION_4_ITEM_3": "Identity Directory: Smart contract che contiene tutti le Decentralized IDentifiers (DID)",
    "SECTION_4_ITEM_4": "Messaging: Un sistema di messaggistica che sfrutta le DID per assicurare validità ed autenticità dei messaggi",
    "SECTION_5_ITEM_1": "EW-Origin: Serve a sviluppare applicazioni che supportino il tracciamento, la trasmissione e il conferimento di energy Attribute Certificate (EAC) secondo gli standard industriali",
    "SECTION_5_ITEM_2": "EW-Flex: Software open source per la gestione dei Distributed Energy Resource (DER) e le operazioni che li coinvolgono. Assicura un facile collegamento alla rete, sottoponendo le offerte provenienti dai piccoli produttori ad un operatore autorizzato che funge da intermediario tra l'utente e la rete"
  },
  "LOGIN": {
    "TITLE": "EW showcase login",
    "TEXT": "Effettua il login con l'estensione browser MetaMask.\nAssicurati di avere qualche Volta sul tuo account",
    "BUTTON_METAMASK": "Login con Metamask",
    "ERROR_UNSUPPORTED_CHAIN": "La rete {{chain}} non è supportata.\nConnettiti alla rete di test volta",
    "NO_METAMASK": "Non hai MetaMask?",
    "WHAT_IS_EW": "Cos'è Energy Web?",
    "CONNECT": "Connettiti",
    "CONNECT_TO_VOLTA": "Non connesso a volta?"
  },
  "ERROR": {
    "GENERIC": "Si è verificato un errore.\nControlla la console per saperne di più",
    "NO_PROVIDER": "Non è stato trovato nessun Ethereum provider.\nScarica MetaMask",
    "NO_ACCOUNT": "Nessun account connesso.\nConnetti un account",
    "REQUEST_ALREADY_SENT": "Una richiesta è già stata inviata. Controlla l'estensione MetaMask",
    "REQUEST_REJECTED": "La richiesta di connessione è stata rifiutata",
    "EMPTY_FIELD": "Il campo non può essere lasciato vuoto",
    "ADDRESS_NOT_FOUND": "L'indirizzo specificato non è stato trovato",
    "INVALID_INPUT": "L'input non è valido",
    "REQUEST_UNAUTHORIZED": "La richiesta non è autorizzata.\nAssicurati di avere i ruoli necessari.",
    "MAX_LENGTH": "Il campo non può essere più lungo di {{max}} caratteri",
    "NOT_POSITIVE": "Il valore deve essere un numero positivo",
    "ONLY_INT": "Sono consentiti solo numeri interi",
    "IAM_CONNECTION": "Si è verificato un errore nella connessione con il server IAM",
    "AGGREGATOR_CONNECTION": "Errore durante la connessione al server dell'aggregatore",
    "SENDING_READINGS": "Si è verificato un errore nell'invio delle letture"
  },
  "ENS": {
    "TITLE": "Energy Web Name Service (EWNS)",
    "SECTION_1_TEXT": "L'Energy Web Name Service è un sistema di denominazione distribuito, aperto ed estensibile basato sulla blockchain di Ethereum. \nAnalogamente a un DNS, gli indirizzi vengono mappati su nomi di dominio leggibili dall'uomo anziché sui valori esadecimali.\nL'implementazione pubblica predefinita consente l'utilizzo di: indirizzi, indirizzi inversi, hash di dati, definizioni ABI, chiavi pubbliche, interfacce di smart contracts e così via.",
    "SECTION_1_TITLE": "Cos'è EWNS?",
    "SECTION_2_TITLE": "Come funziona?",
    "SECTION_2_TEXT": "Per un utente finale il tutto è completamente trasparente. È compito dello sviluppatore di DApp integrare le funzionalità dell'EWNS.\nEsistono diverse librerie che già supportano questa funzione, anche se potrebbe essere necessaria qualche patch manuale.\nIl procedimento per risolvere un dominio con EWNS, comunque, non è particolarmente complicato:",
    "SECTION_2_ITEM_1": "Normalizza ed applica una funzione di hashing sul nome. <a>(Approfondisci)</a>",
    "SECTION_2_ITEM_3": "Usando l'interfaccia del resolver, chiama addr() sull'indirizzo del resolver restituito nel passaggio 2, passando il nome con hash calcolato nel passaggio 1. In alternativa, se non stai cercando un indirizzo, chiama la funzione dell'interfaccia che ti interessa, ad esempio text()",
    "SECTION_2_ITEM_2": "Chiamare resolver() sul registro EWNS, passando l'output del passaggio 1. Ciò restituisce l'indirizzo del resolver responsabile del dominio.",
    "SECTION_2_TEXT_PT_2": "Per saperne di più su come funziona EWNS tecnicamente, visita la <a>wiki ufficiale</a>",
    "SECTION_3_TITLE": "EWNS in azione",
    "SECTION_3_TEXT": "Usa la barra di ricerca di seguito per constatare quanto può essere comodo EWNS.\nProva prima a cercare qualcosa prima con l'indirizzo esadecimale e poi usa il dominio.\nEs. 0xef131ed1460626e97F34243DAc544B42eb52a472 | tend.ewc",
    "SECTION_3_LABEL_1": "Dominio o indirizzo",
    "SEARCH": "Cerca"
  },
  "EW_ACCOUNT": {
    "BALANCE": "Saldo:",
    "TRANSACTION": "Ultime 5 transazioni"
  },
  "FOOTER": {
    "LEGAL": "Tutti i nomi, loghi, immagini e brand appartengono ai rispettivi proprietari."
  },
  "NAV": {
    "ADDRESS_COPIED": "Indirizzo copiato",
    "REFERENCES": "Bibliografia"
  },
  "DID": {
    "TITLE": "Decentralized IDentifiers (DIDs)",
    "SECTION_1_TITLE": "Cos'è un DID?",
    "SECTION_1_TEXT": "I DID sono identificatori univoci usati per realizzare identità digitali verificabili e decentralizzate. Sono la base per l'implementazione delle Self Sovrain Identity (SSI).\nIl soggetto identificato può essere qualsiasi cosa: una persona, un'organizzazione o un bene fisico, per fare qualche esempio.\nUn DID si comporta come un URL e punta ad un DID document, archiviato su un archivio pubblico permanente, come una blockchain.\nChiunque può creare un nuovo DID in qualsiasi momento, ma le caratteristiche (claims) continueranno a riferirsi al DID a cui erano state assegnate.",
    "SECTION_1_IMG": "Semplice esempio di un Decentralized IDentifier (DID) con i suoi componenti",
    "SECTION_2_IMG": "Panoramica dell'architettura dei DID e le relazioni fra le componenti fondamentali",
    "SECTION_3_TITLE": "Qual è lo scopo delle DID?",
    "SECTION_3_TEXT": "Il soggetto identificato ha bisogno di un’identità per essere in grado di dimostrare di possedere determinati tratti o caratteristiche a un verificatore.\nIl verificatore ha un certo numero di emittenti di fiducia ed è disposto ad accettarne i claims, cioè le affermazioni.\nIl soggetto può chiedere a uno di questi emittenti di aggiungere una dichiarazione firmata sul proprio documento DID,\nInoltre, sia l'emittente che il verificatore devono essere in grado di verificare che il soggetto sia effettivamente il proprietario dell'identità. Ciò si ottiene tramite DIDAuth.\nQuesto processo può assumere molte forme, come specificato nel documento DID, ma un modo comune è attraverso un challenge inviata dall'emittente o dal verificatore al soggetto, del quale conoscono la chiave pubblica grazie al DID document, che a sua volta risponderà firmando con la propria chiave privata, dimostrando la propria identità.\n\nProviamo un'analogia con il mondo reale.\nVuoi comprare alcool al bar. Per farlo, devi essere in grado di dimostrare al barista di avere almeno 18 anni. Il barista in questo caso è il verificatore.\nPuoi dimostrare la tua richiesta mostrando la tua carta d'identità.\nQuesta viene rilasciato dal governo, che funge da emittente di fiducia per il barman, il quale verificherà che tu sia effettivamente la persona raffigurata nella foto e si convincerà che sei maggiorenne.",
    "SECTION_3_IMG": "Possibile flusso che mostra come un'interazione di autenticazione potrebbe utilizzare DID per l'autenticazione autonoma",
    "SECTION_2_TEXT": "Un DID è, in sostanza, un URI composto da tre parti: lo schema DID:, un metodo e un identificatore univoco rispetto al metodo.\nI DID sono risolvibili in documenti DID, semplici file JSON-LD. Il documento DID contiene tutte le informazioni, o claims, relative al soggetto identificato dal DID e fornisce una serie di meccanismi che consentono a un controller del DID di dimostrare il proprio controllo sul DID. Tipicamente esprimono anche metodi di verifica, come chiavi pubbliche crittografiche, e servizi relativi alle interazioni con il soggetto DID.\n\nIl controller di un DID è l'entità che ha la capacità di apportare modifiche a un documento DID. Questa capacità in genere è subordinata al possesso dal possesso della coppia di chiavi crittografiche. Si noti che un DID potrebbe avere più di un controller e il soggetto DID può essere il controller DID o uno di essi.\n\nI sistemi che supportano la registrazione dei DID e la restituzione dei dati necessari per produrre documenti DID sono chiamati \"verifiable data registry\".\nUn risolutore DID è il componente che, dato un DID, restituisce il documento corrispondente. Questo processo è chiamato risoluzione DID.",
    "SECTION_2_TITLE": "Uno sguardo più approfondito ai DID",
    "SECTION_4_TITLE": "DID in azione",
    "SECTION_4_TEXT": "Energy web utilizza i DID per identificare utenti, organizzazioni e risorse. In questo modo, le informazioni sull'entità sono pubblicamente verificabili.\nAd esempio, potresti emettere un certificato di energia rinnovabile e assegnarlo a un bene specifico.\nInoltre, ad ogni indirizzo wallet può corrispondere un DID. Questo è utile per creare un sistema IAM basato sui ruoli.",
    "DID_VERIFIED": "DID verificato con successo",
    "DID_LOADING": "Loading...\nAspetta per confermare la transazione con MetaMask",
    "DID_ERROR": "Si è verificato un errore con il login.\nSe hai rifiutato la richiesta, puoi provare nuovamente.\nSe questa è la priva volta che esegui l'operazione, hai bisogno di un po' di Volta token per creare la DID.\nPuoi ottenere di Volta token dal <a>Volta Faucet</a>.",
    "LOGIN": "Connettiti con MetaMask",
    "LOGOUT": "Log out",
    "ASSET_DID": "DID della risorsa",
    "DID_ADDRESS": "Indirizzo",
    "DID_BIRTHDATE": "Data di nascita",
    "DID_NAME": "Nome",
    "NO_CLAIMS": "Non sono stati trovati claims relativi al profilo",
    "USER_DID": "DID utente",
    "EDIT_TITLE": "Modifica le informazioni del profilo"
  },
  "GENERAL": {
    "CANCEL": "Annulla",
    "SUBMIT": "Invia",
    "CONDITIONS": "Condizioni",
    "FIELDS": "Campi",
    "ISSUER_LIST": "Lista di emittenti",
    "ISSUER_TYPE": "Tipo di emittente",
    "LABEL": "Label",
    "MAX_DATE": "Data max",
    "MAX_LENGTH": "Lunghezza max",
    "MAX_VALUE": "Valore max",
    "MIN_DATE": "Data min",
    "MIN_LENGTH": "Lunghezza min",
    "MIN_VALUE": "Valore min",
    "NAME": "Nome",
    "NAMESPACE": "Namespace",
    "PATTERN": "Pattern",
    "REQUIRED": "Richiesto",
    "RESTRICTIONS_ROLE_PRECONDITIONS": "Restrizioni(Ruoli come Precondizioni)",
    "TYPE": "Tipo",
    "VERSION": "Versione",
    "APPS": "Applicazioni",
    "DESCRIPTION": "Descrizione",
    "ROLES": "Ruoli",
    "SUBORGS": "Sotto-organizzazioni",
    "OTHER_JSON": "Altro (JSON)",
    "WEBSITE": "Website",
    "ASSET_DID": "DID della risorsa",
    "PRICE": "Prezzo",
    "VOLUME": "Volume",
    "REMAINING_VOLUME": "Volume rimanente",
    "BUYER": "Acquirente",
    "AGGREGATOR": "Aggregatore",
    "ACTIONS": "Azioni",
    "OWNER": "Proprietario",
    "OFFER": "Offerta",
    "DEMAND": "Domanda",
    "NO_DEMANDS": "Nessun acquirente è stato trovato",
    "SELECT": "Seleziona",
    "SELECTED": "Selezionato",
    "ACCEPTED": "Accettato",
    "ID": "ID",
    "MATCH": "Abbinamento",
    "PENDING": "In sospeso",
    "MATCHES": "Abbinamenti",
    "NO_UNDO_ACTION": "Questa azione non può essere annullata",
    "CONTRACTS_USED": "Contratti utilizzati:",
    "LOGIN": "Login",
    "LOGOUT": "Logout",
    "AGGREGATED_READINGS": "Letture aggregate",
    "PRECISE_PROOFS": "Precise proof",
    "READINGS": "Letture",
    "WARNING": "Attenzione",
    "CREATE_READINGS": "Invia letture"
  },
  "REFERENCES": {
    "TITLE": "Bibliografia",
    "SECTION_1_TITLE": "Documentazione",
    "SECTION_2_TITLE": "Immagini",
    "SECTION_1_ITEM_1": "Energy Web",
    "SECTION_1_ITEM_2": "Energy Web Wiki",
    "SECTION_1_ITEM_3": "Energy Web paper",
    "SECTION_1_ITEM_4": "Energy Web insights (Medium)",
    "SECTION_1_ITEM_5": "Decentralized Identifiers (W3.org)",
    "SECTION_2_ITEM_1": "EW-DOS",
    "SECTION_2_ITEM_2": "DID-schema",
    "SECTION_2_ITEM_3": "DID-architecture",
    "SECTION_2_ITEM_4": "DID-use",
    "SECTION_3_ITEM_1": "Switchboard",
    "SECTION_3_ITEM_2": "EWNS",
    "SECTION_3_TITLE": "DApps ufficiali",
    "SECTION_2_ITEM_5": "IAM-process",
    "SECTION_4_TITLE": "Relazione",
    "SECTION_4_ITEM_1": "Tesi"
  },
  "IAM": {
    "SECTION_1_TEXT": "IAM è un insieme di policy in grado di garantire che solo le entità con le credenziali e le autorizzazioni necessarie possano accedere alle risorse.\nIl sistema deve prima controllare l'identità digitale del soggetto e verificare i ruoli ad esso associati.\nL'operazione viene autorizzata solo se il soggetto ha i ruoli necessari.\nPer assicurare l'accountability, viene utilizzato un sistema di logging per registrare ogni operazione eseguita dal soggetto.",
    "SECTION_2_TEXT": "<p>Per implementare un sistema IAM decentralizzato bisogna garantire alcune proprietà.</p>\n\n<h5>L'IAM deve essere resistente alla censura.</h5>\n<p>Significa che non esiste alcun attore nel sistema che abbia il potere di limitare selettivamente le informazioni a cui gli altri hanno accesso.\nQuesto aspetto è importante perché informazioni riguardanti situazioni casi in cui un'autorizzazione o una chiave è stata revocata o invalidata o se è stata appena concessa un'autorizzazione devono essere disponibili pubblicamente.\nUna blockchain, per sua natura, soddisfa questi requisiti. Inoltre, le prove crittografiche contenute nelle transazioni consentono la verifica offline dei dati.\nPer questo tutti i permessi sono on-chain e la descrizione dei ruoli è contenuta in uno smart contract ENS.</p>\n\n<h5>Le informazioni su utenti e ruoli devono essere riservate.</h5>\n<p>Nella soluzione di Energy Web, nessuna terza parte dispone dell'elenco completo degli utenti di un'applicazione.\nCiò è garantito dal processo di concessione dell'autorizzazione, poiché è l'utente che archivia il claim e lo salva sulla blockchain, consentendogli di dimostrare che gli è stato concessa una determinata autorizzazione.\nInoltre, poiché si tratta di una rivendicazione privata, i contenuti sono dimostrabili ma non divulgati.\nL'unica informazione che un osservatore può raccogliere è che l'utente ha aggiunto un claim al proprio DID document, ma non il contenuto, l'origine o la natura del claim.</p>\n<fig></fig>\n\n<h5>Deve basarsi su un'infrastruttura decentralizzata.</h5>\n<p>Ciò si ottiene utilizzando una combinazione della blockchain di Energy Web e di <a>IPFS</a>, entrambe sistemi distribuiti.\nUn ulteriore layer renderà ancora più semplice la gestione dell'IAM: un servizio di messaggistica fornito dai nodi di servizio dell'EW-DOS.\nOgni messaggio sarà firmato dal mittente, per evitare qualsiasi alterazione dolosa.</p>",
    "SECTION_2_IMG": "Processo di rilascio delle autorizzazioni dell'IAM",
    "SECTION_3_TITLE": "IAM in azione",
    "SECTION_3_TEXT": "Per avere un esempio più concreto di utilizzo dell'IAM, è stata preparata una piccola demo.\n\nLa struttura è la seguente:\nl'organizzazione principale \"unict\" ha una sotto-organizzazione \"test\".\n\nAd quest'ultima appartengono due ruoli: \"testrole\" e \"student\". Puoi usare il tuo DID per provare a registrarti per entrambi i ruoli.\nLe domande al primo necessita dell'approvazione di un DID specifico, mentre per il secondo chiunque abbia un ruolo di \"testrole\" può approvare la domanda.\nI ruoli possono avere dei campi opzionali contenenti una quantità arbitraria di dati di diversi tipi.\n\nEsiste anche un'app chiamata \"TESTAPP\" associata all'organizzazione che presenta il ruolo \"juniordev\".\n\nQuesto tipo di gerarchia garantisce un controllo preciso e flessibile sui permessi all'interno di un'organizzazione.",
    "SECTION_1_TITLE": "Cos'è IAM?",
    "SECTION_2_TITLE": "Proprietà di un IAM decentralizzato",
    "TITLE": "Identity and Access Management (IAM)",
    "CONNECTION_SUCCESS": "Connesso con il server IAM!",
    "CONNECTION_PROGRESS": "Connessione al server IAM..."
  },
  "MARKETPLACE": {
    "TITLE": "Marketplace",
    "NO_ASSET": "Non sono state trovate risorse che soddisfano i requisiti",
    "EDIT_OFFER": "Modifica l'offerta",
    "ADD_ASSET": "Crea una nuova risorsa",
    "CANCEL_OFFER": "Annulla l'offerta",
    "CANCEL_OFFER_CONFIRM": "Sei sicuro di voler annullare l'offerta?",
    "CREATE_OFFER": "Crea un'offerta",
    "VIEW_OFFER": "Dettagli dell'offerta",
    "EDIT_DEMAND": "Modifica la domanda",
    "CREATE_DEMAND": "Pubblica una domanda",
    "NO_DEMANDS": "Non sono stati trovate domande che soddisfano i requisiti",
    "PROPOSE_MATCH": "Proponi un abbinamento",
    "PROPOSE_ASSET_RULE": "Seleziona una risorsa e un acquirente in modo che le rispettive offerte e domanda siano compatibili.\nIl volume residuo dell'offerta deve essere MAGGIORE O UGUALE del fabbisogno della domanda.\nIl prezzo dell'offerta deve essere MINORE O UGUALE al prezzo nella domanda.",
    "CREATE_OFFER_RULE": "Registra una nuova risorsa.\nÈ possibile creare un'offerta per una qualsiasi risorsa che possiedi.\nL'offerta può essere modificata o cancellata dopo la sua creazione.\nUna volta che un acquirente è stato abbinato alla tua offerta, non potrai modificarla finché l'abbinamento non sarà stato annullato.",
    "CREATE_DEMAND_RULE": "È possibile creare una domanda legata al tuo indirizzo.\nLa domanda può essere modificata o cancellata dopo la sua pubblicazione.\nUn aggregatore abbinerà la domanda con un'offerta adeguata.\nPotrai accettare o rifiutare l'abbinamento.\nUna volta che un'offerta è stata abbinata alla tua richiesta, non potrai modificarla finché l'abbinamento non sarà stato annullato.",
    "ACCEPT_MATCH": "Accetta abbinamento",
    "ACCEPT_MATCH_CONFIRM": "Do you really want to accept this match?",
    "DELETE_MATCH": "Annulla abbinamento",
    "DELETE_MATCH_CONFIRM": "Vuoi davvero annullare questo abbinamento?",
    "CANCEL_DEMAND": "Annulla domanda",
    "CANCEL_DEMAND_CONFIRM": "Sei sicuro di voler annullare l'offerta?",
    "REJECT_MATCH_CONFIRM": "Sei sicuro di voler rifiutare l'abbinamento?",
    "REJECT_MATCH": "Rifiuta l'abbinamento"
  },
  "ASSET": {
    "FORM": {
      "ASSET_DID": "DID del DER",
      "ASSET_OWNED": "Elenco dei DER posseduti",
      "FORM_TITLE": "Filtro delle letture",
      "LIMIT": "Limite",
      "OFFSET": "Sfasamento",
      "START": "Inizio",
      "STOP": "Fine",
      "VALIDATION": {
        "DID": "DID non valido. \nDeve essere nel formato did:ethr:<indirizzo-eth>",
        "TIME": "Valore temporale non valido. \nDeve essere una finestra temporale o una data",
        "REQUIRED": "Campo richiesto",
        "INTERVAL": "Intervallo non valido. Deve essere una finestra temporale"
      },
      "ROOT_HASH_PRODUCED": "Precise proof sulla blockchain",
      "AGGRETATION_FUNCTION": {
        "COUNT": "Contare",
        "MAX": "Massimo",
        "MEAN": "Media",
        "MIN": "Minimo",
        "SUM": "Somma",
        "LAST": "Ultima"
      },
      "AGGREGATIO_WINDOW": "Finestra temporale di aggregazione",
      "DIFFERENCE": "Differenza",
      "AGGREGATION_FUNCTION": "Funzione di aggregazione",
      "NO_ASSETS": "Non sono stati trovati DER nel database dell'aggregatore. Assicurati di aver registrato almeno una lettura."
    }
  },
  "AGGREGATOR": {
    "CONNECTION_PROGRESS": "Connessione al server dell'aggregatore...",
    "CONNECTION_SUCCESS": "Connesso al server dell'aggregatore!"
  },
  "READINGS": {
    "FORM": {
      "FORM_TITLE": "Genera delle letture di prova",
      "INTERVAL": "Intervallo fra le letture (sec)",
      "N_READINGS": "Numero di letture",
      "MIN_VALUE": "Valore minimo",
      "MAX_VALUE": "Valore massimo"
    }
  }
}
